Repository: lf-j/OpenSourceComplianceHandbook-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: ja

source: Upon the submission of the form, a compliance ticket (in a system such as JIRA or Bugzilla) will be created automatically, and a source code scanning request will be sent to the auditing staff.
ja: フォームの提出によって、（JIRAやBugzillaなどのシステムで）コンプライアンス チケットが自動的に生成され、ソース コード スキャン要求が監査スタッフへ送られます。

source: Use Case
ja: ユースケース

source: Use a bill of material (BOM) difference tool that allows the identification of software components that change across releases
ja: 一覧表 (BOM) 差分検出ツールを使いリリース毎のソフトウェアコンポーネント変更を特定

source: Use a bill of material (BOM) difference tool that allows the identification of software components that change across releases Re-introduce the newer version of the software component in the compliance process Add the “compute diffs” of any modified source code (eligible for open source distribution) to the checklist item before releasing open source used in the product
ja: 部品表 (bill of material, BOM) 差分検出ツールを使いリリース毎のソフトウェアコンポーネント変更を特定 コンプライアンスプロセスにおいて、より新しいバージョンのソフトウェアコンポーネントを再導入 「diffの計算」を変更された(オープンソースとするにふさわしい) ソースコードのチェックリストに加え 、製品に使われたオープンソースのリリース前に行う

source: Use clear language in the written offer and be inclusive of all open source included in the product.
ja: 書面による申出には、明快な言葉を使い、製品に使われている全てのオープン ソースが含まれるようにします。

source: Use of open source in enterprise IT has doubled since 2010.
ja: エンタープライズITでのオープン ソースの利用は、2010年から倍増しています。

source: Use of shared header files
ja: 共有ヘッダ ファイルの利用

source: Use of shared header files .
ja: 共有ヘッダ ファイルの利用

source: Use open source within the guidelines that the OSRB has set and do not cause a compliance violation
ja: OSRBが制定したガイドラインの範囲内でオープン ソースを利用し、コンプライアンス違反を起こさない。

source: Use with no problem
ja: 問題なく利用

source: Using previously approved open source in a different product
ja: 以前、異なる製品で承認を受けたオープン ソースの利用

source: Usually, these values are chosen from a pull-down menu to make the data entry efficient.
ja: 通常、これらの値は、データ入力を効率的に行うために、プルダウン メニューで選べるようにします。

source: Utilize tools and automation to support efficient processing of compliance tickets.
ja: コンプライアンス チケットを効率的に処理するためツールや自動化を利用します。

source: Various approaches can help ease or solve such challenges and assist in the creation of a streamlined program that is not seen as a burden to development activities.
ja: こうした難しさを和らげ解決し、開発活動にとって重荷とは見做されない能率的なプログラム確立を助ける様々な手段があります。

source: Various reviews are performed, as illustrated in Figure 13 (next page), and all identified issues must be resolved.
ja: 図13（次ページ）に示すように、様々なレビューが実施され、特定された全ての課題は解決していなければなりません。

source: Verification of all the steps in the process
ja: プロセス中の全段階の検証

source: Verification of whether a specific open source component is used in a product or service
ja: 特定のオープン ソース コンポーネントが製品やサービスで利用されているかどうかの確認

source: Verification of whether a specific open source component is used in a product or service .
ja: 特定のオープン ソース コンポーネントが製品やサービスで利用されているかどうかの確認

source: Verifications
ja: 検証

source: Verifications 115
ja: 検証 115

source: Verify that all subtasks related to the compliance ticket have been completed and closed before approving the compliance ticket.
ja: コンプライアンス チケットに関連する全てのサブタスクは、コンプライアンス チケットを承認する前に、完了し、クローズされていることを検証します。

source: Verify that the modifications that were introduced to the open source package are documented and included in the open source release notes as part of the change log.
ja: オープン ソース パッケージに加えられた変更は、文書化されて、オープン ソースのリリース ノートに変更履歴として含まれていることを検証します。

source: Verify that the package adheres to the linkage relationships and interactions defined in the OSRB usage form.
ja: パッケージが、OSRB利用フォームで定義されたリンク関係や相互作用を守っていることを検証します。

source: Verify that the source code to be distributed corresponds to the binary that goes with the product, that the source code builds into the same library distributed with the product, and that build instructions are included in the source distribution (derived binaries are usually identical except for time/date stamp).
ja: 製品に搭載されて出荷されるバイナリに対応したソース コードであること、そのソース コードが製品とともに出荷されるライブラリを構成していること、ビルド手順がソース頒布（派生するバイナリは、タイム スタンプを除いて通常同一のものになります）に含まれていること、を検証します。

source: Verify that the written offer is sufficient to cover all parts of the source code that require such an offer (principally, code licensed under any of the GPL/LGPL family of licenses).
ja: 書面による申出が、そういう通知を必要とするソース コード（基本的に、GPL/LGPL系ライセンスで許諾されたコード）全てを包含しているかを検証します。

source: Verify the resolution of issues that deter releasing product or launching services that contain open source.
ja: オープンソースを含む製品のリリースやサービスの開始を取りやめる決定を検証

source: Verifying engineers are following the guidelines set by the OSRB
ja: OSRBによって定められたガイドラインに従って技術者が行動していることを検証します。

source: Verifying engineers are following the guidelines set by the OSRB .
ja: OSRBによって定められたガイドラインに従って技術者が行動していることを検証します。 .

source: WEB PORTALS
ja: ウェブ ポータル

source: WEB PORTALS 126
ja: ウェブ ポータル 126

source: We then discuss eight possible scenarios.
ja: 8つの可能なプロセスを議論します。

source: Web Presence
ja: ウェブ上のプレゼンス

source: Web Presence 35
ja: ウェブ上のプレゼンス 35

source: Website URL
ja: ウェブサイトURL

source: Website dedicated to distributing open source software for the purpose of compliance
ja: コンプライアンス遵守のためにオープンソースを配布するためのウェブサイト

source: Website dedicated to distributing open source software for the purpose of compliance .
ja: コンプライアンス遵守のためにオープンソースを配布するためのウェブサイト.

source: We’ll begin this chapter with an overview of the core elements needed in a successful open source compliance program.
ja: 最初に、成功するオープンソース コンプライアンス プログラムでコアとなる構成要素を概観します。

source: What you see in Figure 10 is just one example, as there are many ways of organizing the compliance process to accomplish the same goals.
ja: 図10に示されているのは一例であり、同じ目的を達成するためにコンプライアンス プロセスを作る方法は多くあります。

source: Whatever your preference, tools should reflect the workflow of compliance processes, facilitating moving compliance tickets from one phase of the process to another, providing task and resource management, time tracking, email notifications, project statistics, and reporting capabilities.
ja: どちらにしても、ツールは、プロセスのある段階から別の段階へコンプライアンス チケットを移し、タスクやリソースの管理、時間追跡、email通知、プロジェクト統計、報告機能などを提供して、コンプライアンス プロセスのワークフローを反映させるべきです。

source: When a compliance ticket reaches the legal review phase, it already contains:
ja: コンプライアンス チケットが法務レビュー フェーズへ届いた時には、コンプライアンス チケットは以下を含んでいます。

source: When a new or novel license is encountered that isn’t included in the matrix, that license should be analyzed by the Legal Counsel, who should update the table accordingly.
ja: マトリックスに含まれていない新しいライセンスに出会った時には、そのライセンスは法務担当によって分析されなければなりません。法務担当は、分析結果に基づいて表の更新をするべきです。

source: When developers upgrade versions of open source packages, make sure that licenses of new versions are the same as those employed with older versions.
ja: 開発者がオープン ソース パッケージのバージョンを更新するときには、新しいバージョンに適用されているライセンスが、古いバージョンに適用されていたものと同じであることを確認します。

source: When development teams need to combine code under different open source licenses, they can refer to this matrix to determine if joining the software components in question creates a licensing conflict.
ja: 開発チームは、異なるライセンスで許諾されたコードを結合する必要がある時には、問題となっている結合したソフトウェア コンポーネントがライセンス的な矛盾を発生させるかを確認するために、このマトリックスを参照できます。

source: When in doubt with the scan results, discuss with Engineering (interview developers responsible for specific software components in question).
ja: スキャン結果に疑問がある場合は、技術担当者と検討します。（問題となっているソフトウェア コンポーネントの担当開発者にインタビューします。）

source: When it comes to open source compliance, several checklists can be developed and used before committing new external open source code to the product’s source code repository.
ja: オープン ソース コンプライアンスで利用する時には、いくつかのチェックリストを作り上げ、製品のソース コード リポジトリへ外部の新しいオープン ソース コードを入れる前にチェックリストを使います。

source: When redistributing modified open source code, your modifications need to be clearly marked as such, including a copyright line for those modifications (company, year) while preserving the existing copyright lines.
ja: 変更したオープン ソース コードを再頒布するとき、既存の著作権行をそのまま保持しながら、自分の変更箇所へは、著作権行（会社、年）によって印をつける必要があります。

source: When source code is scanned and compliance issues are discovered and flagged, there are a number of ways to resolve issues:
ja: ソースコードがスキャンされて、コンプライアンス課題が発見され、フラグがつけられた時、課題解決にはいくつもの方法があります。

source: When using the multi-source development model, companies must understand the implications of tens of different licenses (and combinations of licenses) coming from hundreds or even thousands of licensors or contributors (copyright holders).
ja: マルチソースの開発モデルを使うとは、数十の相異なるライセンス（とライセンスの組み合わせ）に基づく数百人、時には数千人のライセンス提供者やコントリビューター（著作権者）と関わること、を企業は理解しなければなりません。

source: When you upgrade the version of an open source package, make sure that the license of the new version is unchanged from the prior version, as license changes can occur between version upgrades.
ja: バージョン更新の間でライセンス変更が起きることがありますので、オープン ソース パッケージのバージョンを更新する時には、新しいバージョンのライセンスが前のバージョンから変更されていないことを確認します。

source: Whenever you are redistributing open source code, with or without modifications, you must preserve the original licensing information, copyright lines, and other attributions.
ja: オープン ソース コードを再頒布する時にはいつでも、変更が伴っても伴わなくても、オリジナルのライセンス情報、著作権行、やその他の帰属情報を維持しなければいけません。

source: Where applicable, all marketing and advertising material (including web- based, magazines, newspapers, flyers, etc.) must display the acknowledgement.
ja: 適用可能ならば、全てのマーケティングや広告の資料（ウェブや雑誌、新聞、チラシ等）は謝辞を表示しなければなりません。

source: Which License
ja: どのライセンス

source: With a dependency-tracking tool that allows discovery of linkages between different software components; ID if type of linkage is allowed per com-pany’s OS policies
ja: 異なるソフトウェアコンポーネント間のリンクを検出できる依存性追跡ツールを利用; 企業のオープンソースポリシーで許容されているかを識別

source: With this understanding comes the ability for your organization to meet its open source software license obligations.
ja: このことを理解することによって、オープン ソース ソフトウェアライセンス義務を果たす組織能力が出来上がります。

source: Written Offer
ja: 書面による申出

source: Written Offer Below is an example of a written offer to provide the source code:
ja: 書面による申出 以下は、ソース コードを提供するための書面による申出の例です。

source: Written Offer 107
ja: 書面による申出 107

source: You can set up a different classification model with different actions depending on your organization’s policies and guidelines.
ja: 自分の組織ポリシーやガイドラインに従って、異なる行動を割り当てるような異なる分類モデルを作成することも可能です。

source: You cannot use the name of the open source project, authors, or contributors in any marketing, advertising, or documentation (hard copy, digital, or on the web) without prior written permission.
ja: オープン ソース プロジェクト、著者、貢献者などの名前を、事前に文書による許諾を受けないで、マーケティング、広告や文書（紙媒体、電子媒体、ウェブなど）に利用することはできません。

source: You need to show that you understand the obligations under the applicable license, communicate how .
ja: 適用されているライセンスに基づく義務を理解していることを示し、いつまでにどのようにして義務を満足するかを伝える必要があります。

source: You need to show that you understand the obligations under the applicable license, communicate how and when you will meet the obligations.
ja: 適用されているライセンスに基づく義務を理解していることを示し、いつまでにどのようにして義務を満足するかを伝える必要があります。

source: You receive verification that the source code is uploaded correctly and accessible for download, and that it corresponds to the same version that was approved.
ja: ソース コードは正しくアップロードされ、ダウンロード可能で、承認されたものと同じバージョンに対応しているという確認結果を受けます。

source: You should rely on your build tools (SCM, build automation, etc.) to identify code changes, who made them, and when.
ja: 誰が、いつ、コード変更を行ったかを特定するには、ビルド ツール(SCM, build automation, etc.)に頼るべきです。

source: You still need to verify that:
ja: 以下を検証する必要があります。

source: You will need proper tooling to accommodate a large-scale operation.
ja: 大規模に行うには適切なツールが必要となります。

source: Your software suppliers may not have great open source compliance practices, and it is recommended that you update your contractual agreement to include language related to open source disclosures.
ja: あなたのサプライヤがオープンソース コンプライアンスを見事に実践しているとは限りません。オープンソースの開示に関わる文言を入れるよう、契約を見直すべきです。

source: You’re probably already familiar with some of the guidelines that apply to open source licenses, such as not using the name of the open source project for endorsement, marking the source code modifications you have introduced, and preserving the original licensing, copyright, and attribution information.
ja: オープン ソース プロジェクト名を推奨に利用しない、自分たちが行ったソース コード変更に印をつける、オリジナルのライセンス、著作権、帰属情報を保持する、などオープン ソース ライセンスを応用するガイドラインのいくつかについては既に良く知っているかもしれません。

source: You’ve performed a linguistic review.
ja: リンギスティック レビューを実施しています。

source: [Requires Pre-Approval]
ja: 「事前承認必要」

source: addresses the appropriate licenses for works that combine two or more licenses (combined outlicensing).
ja: 二つやそれ以上のライセンス（結合されたアウトライセンス）を結合した作成物に対する適切なライセンスについても言及します。

source: agency that oversees $66 billion of procurement annually)
ja: （年間660億ドルの調達を行う米国政府機関）

source: an airborne Internet of Things.”
ja: それは、飛行するIoTです。」

source: and M.Sc.
ja: 修士

source: and some were formally challenged .
ja: （場合によっては正式な申し立て）を、

source: because they ignored requests to provide additional compliance information, did not know how to handle compliance inquires, lacked or had a poor open source compliance program, or simply refused to cooperate with the inquirer.
ja: コンプライアンスについての追加情報提供の要請を無視したり、コンプライアンスの照会を扱う方法を知らなかったり、オープンソース コンプライアンス プログラムが欠落していたり不十分だったり、単に照会者と協力しなかったために、受けてきました。

source: dependent on products, technologies, mergers, acquisitions, offshore development activities, and many other factors.
ja: 製品や技術、企業の吸収や合併、海外への委託、その他多くの要因によって動きます。

source: formally or informally .
ja: 公式、非公式を問わず、

source: in this example, v 1.1.
ja: この例では、V 1.1です。

source: information provided with the source code package.
ja: ソースコードのパッケージに添付のライセンス情報を使います。

source: is to raise awareness of open source policies and strategies and to build a common understanding around the issues and facts of open source licensing as well as the business and legal risks of incorporating open source software in products and/or software portfolios.
ja: オープンソースのポリシーや戦略、オープンソースのライセンスや、製品やソフトウェア ポートフォリオにオープンソース ソフトウェアに組み入れることのビジネス的、法的リスクについて共通理解を作り上げ、注意喚起することです。

source: lessons that we will explore in following subsections.
ja: 次のような教訓を学びつつあります。

source: processes are usually home-grown and/or built as mash-ups of existing tools and capabilities.
ja: 通常、自社内製であるか、かつ／または、既存ツールや機能をより集めて作られたものです。

source: providing the original open source code along with the company’s contributed patch files that apply against the original open source code.
ja: オリジナルのオープン ソース コードと共に、そのコードに適用させる自社の貢献修正ファイルを提供しました。

source: rather, they should acknowledge receipt of inquiries, inform inquiring parties of pending response, and provide an estimated date for follow-up.
ja: むしろ、照会を受け取ったことを知らせ、照会者に回答を保留していることを伝え、回答予定日を知らせるべきです。

source: that is, it is still in use, is the same version, and has the same usage model (Figure 18, next page) .
ja: つまり、まだ使用されており、同じバージョンであり、利用形態が同じであること（次ページの図18）

source: the compliance officer will:
ja: コンプライアンス オフィサーは、

source: usage not allowed by company policy.
ja: 企業ポリシーによって利用が許可されていません。

source: “Advertising materials may need special acknowledgments”
ja: 「広告資料は、特別な謝辞が必要になるかもしれません。」

source: “From increasing member investments to a growing, vibrant developer community, the Dronecode Project’s first year has been extremely exciting.
ja: 「成長し活気ある開発コミュニティへのメンバー投資から、Dronecodeプロジェクトの初年度はかなりエキサイティングなものです。

source: “Must include a copy of the license in documentation available to the end user”
ja: 「エンド ユーザーが利用可能な文書にライセンスのコピーを入れなければならない」

source: “Must include copyright notices in documentation available to the end user”
ja: 「エンド ユーザーが利用可能な文書に著作権表記を入れなければならない」

source: “Open Source First: Simply put, any solution developed using taxpayer dollars should be in the taxpayer’s domain (open source).
ja: 「オープン ソース ファースト：納税者のお金で開発された全てのソリューションは、納税者のものに（オープン ソース）」

source: “Open source is essential to our development process.
ja: 「オープン ソースは、我々の開発に本質的なものです。

source: “Scan early and often” follows the same spirit.
ja: 「早めに、そして頻繁にスキャン“Scan early and often”」は、同じ精神に従っています。

source: “The 2015 Future of Open Source Survey”
ja: 「オープン ソース未来予測2015」

source: “The development of Blockchain technology has the potential to redefine the operations and economics of the financial services industry.
ja: 「ブロックチェーン技術の開発は、金融サービス業界の業務や経済構造を再定義する可能性を秘めています。
